<template>
  <div>
    <lj-indexed :list="list"
      :c="indexedC"></lj-indexed>
  </div>
</template>

<script>
// import cnchar from 'cnchar'
export default {
  props: {

  },
  components: {

  },
  onLoad(argData) {
  },
  onShow() {

  },
  onReady() {

  },
  onUnload() {

  },
  async onPullDownRefresh() {
    // console.log('下拉')
    uni.stopPullDownRefresh()
  },
  async onReachBottom() {
    // console.log('上拉')
  },
  computed: {

  },
  data() {
    return {
      list: [{
        'letter': 'A',
        'data': [
          '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场',
        ]
      }, {
        'letter': 'B',
        'data': [],
      }, {
        'letter': 'C',
        'data': [
          '保山机场',
          '包头机场',
          '北海福成机场',
          '北京南苑机场',
          '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场', '阿克苏机场',
          '阿拉山口机场',
          '阿勒泰机场',
          '阿里昆莎机场',
          '安庆天柱山机场',
          '澳门国际机场',
          '北京首都国际机场'
        ]
      }],
      indexedC: {
        hideKey: true
      },
    }
  },
  methods: {
    init() {
      let letter = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']
      let temList = []
      let temObj = {}
      letter.map((v, k) => {
        let item = {
          key: v,
          index: k,
          items: [],
        }
        temList.push(item)
        temObj[v] = item
      })
      let a = [
        {
          name: '阿bb',
        },
        {
          name: '人阿bb',
        },
        {
          name: '我阿bb',
        },
        {
          name: '去阿bb',
        },
      ]
      a.map((v, k) => {
        v.index = k
        // v.letter = cnchar.spell(v.name, 'first')[0]
        v.hide = false
        temObj[v.letter].items.push(v)
      })
      a[0].index = 100
      console.error(temList)
      // a.map(v => {
      //   console.error(cnchar.spell(v)[0])
      //   // return cnchar.spell(v, 'first')[0]
      // })
      console.error(a)
      // console.log(cnchar.spell('汉字', 'array', 'low'))
    }
  },
}
</script>

<style lang="scss">
</style>
